Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_usart2.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32L4R5_usart2.
; =================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32L4R5_usart2 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// USART2 address definitions
// --------------------------

typedef struct {
        union {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR1_ALTERNATE;
        };
    volatile    uint32_t    CR2;
    volatile    uint32_t    CR3;
    volatile    uint32_t    BRR;
    volatile    uint32_t    GTPR;
    volatile    uint32_t    RTOR;
    volatile    uint32_t    RQR;
        union {
    volatile    uint32_t    ISR;
    volatile    uint32_t    ISR_ALTERNATE;
        };
    volatile    uint32_t    ICR;
    volatile    uint32_t    RDR;
    volatile    uint32_t    TDR;
    volatile    uint32_t    PRESC;
} USART2_TypeDef;

#ifdef __cplusplus
#define USART2  reinterpret_cast<USART2_TypeDef *>(0x40004400U)

#else
#define USART2  ((USART2_TypeDef *)0x40004400U)
#endif

// CR1 Configuration

#define USART2_CR1_RXFFIE                   (0x1U<<31)
#define USART2_CR1_TXFEIE                   (0x1U<<30)
#define USART2_CR1_FIFOEN                   (0x1U<<29)
#define USART2_CR1_M1                       (0x1U<<28)
#define USART2_CR1_EOBIE                    (0x1U<<27)
#define USART2_CR1_RTOIE                    (0x1U<<26)
#define USART2_CR1_DEAT                     (0x1FU<<21)
#define USART2_CR1_DEAT_0                   (0x1U<<21)
#define USART2_CR1_DEDT                     (0x1FU<<16)
#define USART2_CR1_DEDT_0                   (0x1U<<16)
#define USART2_CR1_OVER8                    (0x1U<<15)
#define USART2_CR1_CMIE                     (0x1U<<14)
#define USART2_CR1_MME                      (0x1U<<13)
#define USART2_CR1_M0                       (0x1U<<12)
#define USART2_CR1_WAKE                     (0x1U<<11)
#define USART2_CR1_PCE                      (0x1U<<10)
#define USART2_CR1_PS                       (0x1U<<9)
#define USART2_CR1_PEIE                     (0x1U<<8)
#define USART2_CR1_TXFNFIE                  (0x1U<<7)
#define USART2_CR1_TCIE                     (0x1U<<6)
#define USART2_CR1_RXFNEIE                  (0x1U<<5)
#define USART2_CR1_IDLEIE                   (0x1U<<4)
#define USART2_CR1_TE                       (0x1U<<3)
#define USART2_CR1_RE                       (0x1U<<2)
#define USART2_CR1_UESM                     (0x1U<<1)
#define USART2_CR1_UE                       (0x1U<<0)
#define USART2_CR1_RXFFIE_B_0X0             (0x0U<<31)
#define USART2_CR1_RXFFIE_B_0X1             (0x1U<<31)
#define USART2_CR1_TXFEIE_B_0X0             (0x0U<<30)
#define USART2_CR1_TXFEIE_B_0X1             (0x1U<<30)
#define USART2_CR1_FIFOEN_B_0X0             (0x0U<<29)
#define USART2_CR1_FIFOEN_B_0X1             (0x1U<<29)
#define USART2_CR1_EOBIE_B_0X0              (0x0U<<27)
#define USART2_CR1_EOBIE_B_0X1              (0x1U<<27)
#define USART2_CR1_RTOIE_B_0X0              (0x0U<<26)
#define USART2_CR1_RTOIE_B_0X1              (0x1U<<26)
#define USART2_CR1_OVER8_B_0X0              (0x0U<<15)
#define USART2_CR1_OVER8_B_0X1              (0x1U<<15)
#define USART2_CR1_CMIE_B_0X0               (0x0U<<14)
#define USART2_CR1_CMIE_B_0X1               (0x1U<<14)
#define USART2_CR1_MME_B_0X0                (0x0U<<13)
#define USART2_CR1_MME_B_0X1                (0x1U<<13)
#define USART2_CR1_WAKE_B_0X0               (0x0U<<11)
#define USART2_CR1_WAKE_B_0X1               (0x1U<<11)
#define USART2_CR1_PCE_B_0X0                (0x0U<<10)
#define USART2_CR1_PCE_B_0X1                (0x1U<<10)
#define USART2_CR1_PS_B_0X0                 (0x0U<<9)
#define USART2_CR1_PS_B_0X1                 (0x1U<<9)
#define USART2_CR1_PEIE_B_0X0               (0x0U<<8)
#define USART2_CR1_PEIE_B_0X1               (0x1U<<8)
#define USART2_CR1_TXFNFIE_B_0X0            (0x0U<<7)
#define USART2_CR1_TXFNFIE_B_0X1            (0x1U<<7)
#define USART2_CR1_TCIE_B_0X0               (0x0U<<6)
#define USART2_CR1_TCIE_B_0X1               (0x1U<<6)
#define USART2_CR1_RXFNEIE_B_0X0            (0x0U<<5)
#define USART2_CR1_RXFNEIE_B_0X1            (0x1U<<5)
#define USART2_CR1_IDLEIE_B_0X0             (0x0U<<4)
#define USART2_CR1_IDLEIE_B_0X1             (0x1U<<4)
#define USART2_CR1_TE_B_0X0                 (0x0U<<3)
#define USART2_CR1_TE_B_0X1                 (0x1U<<3)
#define USART2_CR1_RE_B_0X0                 (0x0U<<2)
#define USART2_CR1_RE_B_0X1                 (0x1U<<2)
#define USART2_CR1_UESM_B_0X0               (0x0U<<1)
#define USART2_CR1_UESM_B_0X1               (0x1U<<1)
#define USART2_CR1_UE_B_0X0                 (0x0U<<0)
#define USART2_CR1_UE_B_0X1                 (0x1U<<0)

// CR1_ALTERNATE Configuration

#define USART2_CR1_ALTERNATE_FIFOEN         (0x1U<<29)
#define USART2_CR1_ALTERNATE_M1             (0x1U<<28)
#define USART2_CR1_ALTERNATE_EOBIE          (0x1U<<27)
#define USART2_CR1_ALTERNATE_RTOIE          (0x1U<<26)
#define USART2_CR1_ALTERNATE_DEAT           (0x1FU<<21)
#define USART2_CR1_ALTERNATE_DEAT_0         (0x1U<<21)
#define USART2_CR1_ALTERNATE_DEDT           (0x1FU<<16)
#define USART2_CR1_ALTERNATE_DEDT_0         (0x1U<<16)
#define USART2_CR1_ALTERNATE_OVER8          (0x1U<<15)
#define USART2_CR1_ALTERNATE_CMIE           (0x1U<<14)
#define USART2_CR1_ALTERNATE_MME            (0x1U<<13)
#define USART2_CR1_ALTERNATE_M0             (0x1U<<12)
#define USART2_CR1_ALTERNATE_WAKE           (0x1U<<11)
#define USART2_CR1_ALTERNATE_PCE            (0x1U<<10)
#define USART2_CR1_ALTERNATE_PS             (0x1U<<9)
#define USART2_CR1_ALTERNATE_PEIE           (0x1U<<8)
#define USART2_CR1_ALTERNATE_TXEIE          (0x1U<<7)
#define USART2_CR1_ALTERNATE_TCIE           (0x1U<<6)
#define USART2_CR1_ALTERNATE_RXNEIE         (0x1U<<5)
#define USART2_CR1_ALTERNATE_IDLEIE         (0x1U<<4)
#define USART2_CR1_ALTERNATE_TE             (0x1U<<3)
#define USART2_CR1_ALTERNATE_RE             (0x1U<<2)
#define USART2_CR1_ALTERNATE_UESM           (0x1U<<1)
#define USART2_CR1_ALTERNATE_UE             (0x1U<<0)
#define USART2_CR1_ALTERNATE_FIFOEN_B_0X0   (0x0U<<29)
#define USART2_CR1_ALTERNATE_FIFOEN_B_0X1   (0x1U<<29)
#define USART2_CR1_ALTERNATE_EOBIE_B_0X0    (0x0U<<27)
#define USART2_CR1_ALTERNATE_EOBIE_B_0X1    (0x1U<<27)
#define USART2_CR1_ALTERNATE_RTOIE_B_0X0    (0x0U<<26)
#define USART2_CR1_ALTERNATE_RTOIE_B_0X1    (0x1U<<26)
#define USART2_CR1_ALTERNATE_OVER8_B_0X0    (0x0U<<15)
#define USART2_CR1_ALTERNATE_OVER8_B_0X1    (0x1U<<15)
#define USART2_CR1_ALTERNATE_CMIE_B_0X0     (0x0U<<14)
#define USART2_CR1_ALTERNATE_CMIE_B_0X1     (0x1U<<14)
#define USART2_CR1_ALTERNATE_MME_B_0X0      (0x0U<<13)
#define USART2_CR1_ALTERNATE_MME_B_0X1      (0x1U<<13)
#define USART2_CR1_ALTERNATE_WAKE_B_0X0     (0x0U<<11)
#define USART2_CR1_ALTERNATE_WAKE_B_0X1     (0x1U<<11)
#define USART2_CR1_ALTERNATE_PCE_B_0X0      (0x0U<<10)
#define USART2_CR1_ALTERNATE_PCE_B_0X1      (0x1U<<10)
#define USART2_CR1_ALTERNATE_PS_B_0X0       (0x0U<<9)
#define USART2_CR1_ALTERNATE_PS_B_0X1       (0x1U<<9)
#define USART2_CR1_ALTERNATE_PEIE_B_0X0     (0x0U<<8)
#define USART2_CR1_ALTERNATE_PEIE_B_0X1     (0x1U<<8)
#define USART2_CR1_ALTERNATE_TXEIE_B_0X0    (0x0U<<7)
#define USART2_CR1_ALTERNATE_TXEIE_B_0X1    (0x1U<<7)
#define USART2_CR1_ALTERNATE_TCIE_B_0X0     (0x0U<<6)
#define USART2_CR1_ALTERNATE_TCIE_B_0X1     (0x1U<<6)
#define USART2_CR1_ALTERNATE_RXNEIE_B_0X0   (0x0U<<5)
#define USART2_CR1_ALTERNATE_RXNEIE_B_0X1   (0x1U<<5)
#define USART2_CR1_ALTERNATE_IDLEIE_B_0X0   (0x0U<<4)
#define USART2_CR1_ALTERNATE_IDLEIE_B_0X1   (0x1U<<4)
#define USART2_CR1_ALTERNATE_TE_B_0X0       (0x0U<<3)
#define USART2_CR1_ALTERNATE_TE_B_0X1       (0x1U<<3)
#define USART2_CR1_ALTERNATE_RE_B_0X0       (0x0U<<2)
#define USART2_CR1_ALTERNATE_RE_B_0X1       (0x1U<<2)
#define USART2_CR1_ALTERNATE_UESM_B_0X0     (0x0U<<1)
#define USART2_CR1_ALTERNATE_UESM_B_0X1     (0x1U<<1)
#define USART2_CR1_ALTERNATE_UE_B_0X0       (0x0U<<0)
#define USART2_CR1_ALTERNATE_UE_B_0X1       (0x1U<<0)

// CR2 Configuration

#define USART2_CR2_ADD                      (0xFFU<<24)
#define USART2_CR2_ADD_0                    (0x1U<<24)
#define USART2_CR2_RTOEN                    (0x1U<<23)
#define USART2_CR2_ABRMOD                   (0x3U<<21)
#define USART2_CR2_ABRMOD_0                 (0x1U<<21)
#define USART2_CR2_ABREN                    (0x1U<<20)
#define USART2_CR2_MSBFIRST                 (0x1U<<19)
#define USART2_CR2_DATAINV                  (0x1U<<18)
#define USART2_CR2_TXINV                    (0x1U<<17)
#define USART2_CR2_RXINV                    (0x1U<<16)
#define USART2_CR2_SWAP                     (0x1U<<15)
#define USART2_CR2_LINEN                    (0x1U<<14)
#define USART2_CR2_STOP                     (0x3U<<12)
#define USART2_CR2_STOP_0                   (0x1U<<12)
#define USART2_CR2_CLKEN                    (0x1U<<11)
#define USART2_CR2_CPOL                     (0x1U<<10)
#define USART2_CR2_CPHA                     (0x1U<<9)
#define USART2_CR2_LBCL                     (0x1U<<8)
#define USART2_CR2_LBDIE                    (0x1U<<6)
#define USART2_CR2_LBDL                     (0x1U<<5)
#define USART2_CR2_ADDM7                    (0x1U<<4)
#define USART2_CR2_DIS_NSS                  (0x1U<<3)
#define USART2_CR2_SLVEN                    (0x1U<<0)
#define USART2_CR2_RTOEN_B_0X0              (0x0U<<23)
#define USART2_CR2_RTOEN_B_0X1              (0x1U<<23)
#define USART2_CR2_ABRMOD_B_0X0             (0x0U<<21)
#define USART2_CR2_ABRMOD_B_0X1             (0x1U<<21)
#define USART2_CR2_ABRMOD_B_0X2             (0x2U<<21)
#define USART2_CR2_ABRMOD_B_0X3             (0x3U<<21)
#define USART2_CR2_ABREN_B_0X0              (0x0U<<20)
#define USART2_CR2_ABREN_B_0X1              (0x1U<<20)
#define USART2_CR2_MSBFIRST_B_0X0           (0x0U<<19)
#define USART2_CR2_MSBFIRST_B_0X1           (0x1U<<19)
#define USART2_CR2_DATAINV_B_0X0            (0x0U<<18)
#define USART2_CR2_DATAINV_B_0X1            (0x1U<<18)
#define USART2_CR2_TXINV_B_0X0              (0x0U<<17)
#define USART2_CR2_TXINV_B_0X1              (0x1U<<17)
#define USART2_CR2_RXINV_B_0X0              (0x0U<<16)
#define USART2_CR2_RXINV_B_0X1              (0x1U<<16)
#define USART2_CR2_SWAP_B_0X0               (0x0U<<15)
#define USART2_CR2_SWAP_B_0X1               (0x1U<<15)
#define USART2_CR2_LINEN_B_0X0              (0x0U<<14)
#define USART2_CR2_LINEN_B_0X1              (0x1U<<14)
#define USART2_CR2_STOP_B_0X0               (0x0U<<12)
#define USART2_CR2_STOP_B_0X1               (0x1U<<12)
#define USART2_CR2_STOP_B_0X2               (0x2U<<12)
#define USART2_CR2_STOP_B_0X3               (0x3U<<12)
#define USART2_CR2_CLKEN_B_0X0              (0x0U<<11)
#define USART2_CR2_CLKEN_B_0X1              (0x1U<<11)
#define USART2_CR2_CPOL_B_0X0               (0x0U<<10)
#define USART2_CR2_CPOL_B_0X1               (0x1U<<10)
#define USART2_CR2_CPHA_B_0X0               (0x0U<<9)
#define USART2_CR2_CPHA_B_0X1               (0x1U<<9)
#define USART2_CR2_LBCL_B_0X0               (0x0U<<8)
#define USART2_CR2_LBCL_B_0X1               (0x1U<<8)
#define USART2_CR2_LBDIE_B_0X0              (0x0U<<6)
#define USART2_CR2_LBDIE_B_0X1              (0x1U<<6)
#define USART2_CR2_LBDL_B_0X0               (0x0U<<5)
#define USART2_CR2_LBDL_B_0X1               (0x1U<<5)
#define USART2_CR2_ADDM7_B_0X0              (0x0U<<4)
#define USART2_CR2_ADDM7_B_0X1              (0x1U<<4)
#define USART2_CR2_DIS_NSS_B_0X0            (0x0U<<3)
#define USART2_CR2_DIS_NSS_B_0X1            (0x1U<<3)
#define USART2_CR2_SLVEN_B_0X0              (0x0U<<0)
#define USART2_CR2_SLVEN_B_0X1              (0x1U<<0)

// CR3 Configuration

