Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_usart2.h
#define USART2_CR3_TXFTCFG                  (0x7U<<29)
#define USART2_CR3_TXFTCFG_0                (0x1U<<29)
#define USART2_CR3_RXFTIE                   (0x1U<<28)
#define USART2_CR3_RXFTCFG                  (0x7U<<25)
#define USART2_CR3_RXFTCFG_0                (0x1U<<25)
#define USART2_CR3_TCBGTIE                  (0x1U<<24)
#define USART2_CR3_TXFTIE                   (0x1U<<23)
#define USART2_CR3_WUFIE                    (0x1U<<22)
#define USART2_CR3_WUS                      (0x3U<<20)
#define USART2_CR3_WUS_0                    (0x1U<<20)
#define USART2_CR3_SCARCNT                  (0x7U<<17)
#define USART2_CR3_SCARCNT_0                (0x1U<<17)
#define USART2_CR3_DEP                      (0x1U<<15)
#define USART2_CR3_DEM                      (0x1U<<14)
#define USART2_CR3_DDRE                     (0x1U<<13)
#define USART2_CR3_OVRDIS                   (0x1U<<12)
#define USART2_CR3_ONEBIT                   (0x1U<<11)
#define USART2_CR3_CTSIE                    (0x1U<<10)
#define USART2_CR3_CTSE                     (0x1U<<9)
#define USART2_CR3_RTSE                     (0x1U<<8)
#define USART2_CR3_DMAT                     (0x1U<<7)
#define USART2_CR3_DMAR                     (0x1U<<6)
#define USART2_CR3_SCEN                     (0x1U<<5)
#define USART2_CR3_NACK                     (0x1U<<4)
#define USART2_CR3_HDSEL                    (0x1U<<3)
#define USART2_CR3_IRLP                     (0x1U<<2)
#define USART2_CR3_IREN                     (0x1U<<1)
#define USART2_CR3_EIE                      (0x1U<<0)
#define USART2_CR3_TXFTCFG_B_0X0            (0x0U<<29)
#define USART2_CR3_TXFTCFG_B_0X1            (0x1U<<29)
#define USART2_CR3_TXFTCFG_B_0X2            (0x2U<<29)
#define USART2_CR3_TXFTCFG_B_0X3            (0x3U<<29)
#define USART2_CR3_TXFTCFG_B_0X4            (0x4U<<29)
#define USART2_CR3_TXFTCFG_B_0X5            (0x5U<<29)
#define USART2_CR3_RXFTIE_B_0X0             (0x0U<<28)
#define USART2_CR3_RXFTIE_B_0X1             (0x1U<<28)
#define USART2_CR3_RXFTCFG_B_0X0            (0x0U<<25)
#define USART2_CR3_RXFTCFG_B_0X1            (0x1U<<25)
#define USART2_CR3_RXFTCFG_B_0X2            (0x2U<<25)
#define USART2_CR3_RXFTCFG_B_0X3            (0x3U<<25)
#define USART2_CR3_RXFTCFG_B_0X4            (0x4U<<25)
#define USART2_CR3_RXFTCFG_B_0X5            (0x5U<<25)
#define USART2_CR3_TCBGTIE_B_0X0            (0x0U<<24)
#define USART2_CR3_TCBGTIE_B_0X1            (0x1U<<24)
#define USART2_CR3_TXFTIE_B_0X0             (0x0U<<23)
#define USART2_CR3_TXFTIE_B_0X1             (0x1U<<23)
#define USART2_CR3_WUFIE_B_0X0              (0x0U<<22)
#define USART2_CR3_WUFIE_B_0X1              (0x1U<<22)
#define USART2_CR3_WUS_B_0X0                (0x0U<<20)
#define USART2_CR3_WUS_B_0X2                (0x2U<<20)
#define USART2_CR3_WUS_B_0X3                (0x3U<<20)
#define USART2_CR3_SCARCNT_B_0X0            (0x0U<<17)
#define USART2_CR3_DEP_B_0X0                (0x0U<<15)
#define USART2_CR3_DEP_B_0X1                (0x1U<<15)
#define USART2_CR3_DEM_B_0X0                (0x0U<<14)
#define USART2_CR3_DEM_B_0X1                (0x1U<<14)
#define USART2_CR3_DDRE_B_0X0               (0x0U<<13)
#define USART2_CR3_DDRE_B_0X1               (0x1U<<13)
#define USART2_CR3_OVRDIS_B_0X0             (0x0U<<12)
#define USART2_CR3_OVRDIS_B_0X1             (0x1U<<12)
#define USART2_CR3_ONEBIT_B_0X0             (0x0U<<11)
#define USART2_CR3_ONEBIT_B_0X1             (0x1U<<11)
#define USART2_CR3_CTSIE_B_0X0              (0x0U<<10)
#define USART2_CR3_CTSIE_B_0X1              (0x1U<<10)
#define USART2_CR3_CTSE_B_0X0               (0x0U<<9)
#define USART2_CR3_CTSE_B_0X1               (0x1U<<9)
#define USART2_CR3_RTSE_B_0X0               (0x0U<<8)
#define USART2_CR3_RTSE_B_0X1               (0x1U<<8)
#define USART2_CR3_DMAT_B_0X1               (0x1U<<7)
#define USART2_CR3_DMAT_B_0X0               (0x0U<<7)
#define USART2_CR3_DMAR_B_0X1               (0x1U<<6)
#define USART2_CR3_DMAR_B_0X0               (0x0U<<6)
#define USART2_CR3_SCEN_B_0X0               (0x0U<<5)
#define USART2_CR3_SCEN_B_0X1               (0x1U<<5)
#define USART2_CR3_NACK_B_0X0               (0x0U<<4)
#define USART2_CR3_NACK_B_0X1               (0x1U<<4)
#define USART2_CR3_HDSEL_B_0X0              (0x0U<<3)
#define USART2_CR3_HDSEL_B_0X1              (0x1U<<3)
#define USART2_CR3_IRLP_B_0X0               (0x0U<<2)
#define USART2_CR3_IRLP_B_0X1               (0x1U<<2)
#define USART2_CR3_IREN_B_0X0               (0x0U<<1)
#define USART2_CR3_IREN_B_0X1               (0x1U<<1)
#define USART2_CR3_EIE_B_0X0                (0x0U<<0)
#define USART2_CR3_EIE_B_0X1                (0x1U<<0)

// BRR Configuration

#define USART2_BRR_BRR                      (0xFFFFU<<0)
#define USART2_BRR_BRR_0                    (0x1U<<0)

// GTPR Configuration

#define USART2_GTPR_GT                      (0xFFU<<8)
#define USART2_GTPR_GT_0                    (0x1U<<8)
#define USART2_GTPR_PSC                     (0xFFU<<0)
#define USART2_GTPR_PSC_0                   (0x1U<<0)
#define USART2_GTPR_PSC_B_0X0               (0x0U<<0)
#define USART2_GTPR_PSC_B_0X1               (0x1U<<0)
#define USART2_GTPR_PSC_B_0X2               (0x2U<<0)
#define USART2_GTPR_PSC_B_0X3               (0x3U<<0)
#define USART2_GTPR_PSC_B_0X1F              (0x1FU<<0)
#define USART2_GTPR_PSC_B_0X20              (0x20U<<0)
#define USART2_GTPR_PSC_B_0XFF              (0xFFU<<0)

// RTOR Configuration

#define USART2_RTOR_BLEN                    (0xFFU<<24)
#define USART2_RTOR_BLEN_0                  (0x1U<<24)
#define USART2_RTOR_RTO                     (0xFFFFFFU<<0)
#define USART2_RTOR_RTO_0                   (0x1U<<0)

// RQR Configuration

#define USART2_RQR_TXFRQ                    (0x1U<<4)
#define USART2_RQR_RXFRQ                    (0x1U<<3)
#define USART2_RQR_MMRQ                     (0x1U<<2)
#define USART2_RQR_SBKRQ                    (0x1U<<1)
#define USART2_RQR_ABRRQ                    (0x1U<<0)

// ISR Configuration

#define USART2_ISR_TXFT                     (0x1U<<27)
#define USART2_ISR_RXFT                     (0x1U<<26)
#define USART2_ISR_TCBGT                    (0x1U<<25)
#define USART2_ISR_RXFF                     (0x1U<<24)
#define USART2_ISR_TXFE                     (0x1U<<23)
#define USART2_ISR_REACK                    (0x1U<<22)
#define USART2_ISR_TEACK                    (0x1U<<21)
#define USART2_ISR_WUF                      (0x1U<<20)
#define USART2_ISR_RWU                      (0x1U<<19)
#define USART2_ISR_SBKF                     (0x1U<<18)
#define USART2_ISR_CMF                      (0x1U<<17)
#define USART2_ISR_BUSY                     (0x1U<<16)
#define USART2_ISR_ABRF                     (0x1U<<15)
#define USART2_ISR_ABRE                     (0x1U<<14)
#define USART2_ISR_UDR                      (0x1U<<13)
#define USART2_ISR_EOBF                     (0x1U<<12)
#define USART2_ISR_RTOF                     (0x1U<<11)
#define USART2_ISR_CTS                      (0x1U<<10)
#define USART2_ISR_CTSIF                    (0x1U<<9)
#define USART2_ISR_LBDF                     (0x1U<<8)
#define USART2_ISR_TXFNF                    (0x1U<<7)
#define USART2_ISR_TC                       (0x1U<<6)
#define USART2_ISR_RXFNE                    (0x1U<<5)
#define USART2_ISR_IDLE                     (0x1U<<4)
#define USART2_ISR_ORE                      (0x1U<<3)
#define USART2_ISR_NE                       (0x1U<<2)
#define USART2_ISR_FE                       (0x1U<<1)
#define USART2_ISR_PE                       (0x1U<<0)
#define USART2_ISR_TXFT_B_0X0               (0x0U<<27)
#define USART2_ISR_TXFT_B_0X1               (0x1U<<27)
#define USART2_ISR_RXFT_B_0X0               (0x0U<<26)
#define USART2_ISR_RXFT_B_0X1               (0x1U<<26)
#define USART2_ISR_TCBGT_B_0X0              (0x0U<<25)
#define USART2_ISR_TCBGT_B_0X1              (0x1U<<25)
#define USART2_ISR_RXFF_B_0X0               (0x0U<<24)
#define USART2_ISR_RXFF_B_0X1               (0x1U<<24)
#define USART2_ISR_TXFE_B_0X0               (0x0U<<23)
#define USART2_ISR_TXFE_B_0X1               (0x1U<<23)
#define USART2_ISR_RWU_B_0X0                (0x0U<<19)
#define USART2_ISR_RWU_B_0X1                (0x1U<<19)
#define USART2_ISR_SBKF_B_0X0               (0x0U<<18)
#define USART2_ISR_SBKF_B_0X1               (0x1U<<18)
#define USART2_ISR_CMF_B_0X0                (0x0U<<17)
#define USART2_ISR_CMF_B_0X1                (0x1U<<17)
#define USART2_ISR_BUSY_B_0X0               (0x0U<<16)
#define USART2_ISR_BUSY_B_0X1               (0x1U<<16)
#define USART2_ISR_UDR_B_0X0                (0x0U<<13)
#define USART2_ISR_UDR_B_0X1                (0x1U<<13)
#define USART2_ISR_EOBF_B_0X0               (0x0U<<12)
#define USART2_ISR_EOBF_B_0X1               (0x1U<<12)
#define USART2_ISR_RTOF_B_0X0               (0x0U<<11)
#define USART2_ISR_RTOF_B_0X1               (0x1U<<11)
#define USART2_ISR_CTS_B_0X0                (0x0U<<10)
#define USART2_ISR_CTS_B_0X1                (0x1U<<10)
#define USART2_ISR_CTSIF_B_0X0              (0x0U<<9)
#define USART2_ISR_CTSIF_B_0X1              (0x1U<<9)
#define USART2_ISR_LBDF_B_0X0               (0x0U<<8)
#define USART2_ISR_LBDF_B_0X1               (0x1U<<8)
#define USART2_ISR_TXFNF_B_0X0              (0x0U<<7)
#define USART2_ISR_TXFNF_B_0X1              (0x1U<<7)
#define USART2_ISR_TC_B_0X0                 (0x0U<<6)
#define USART2_ISR_TC_B_0X1                 (0x1U<<6)
#define USART2_ISR_RXFNE_B_0X0              (0x0U<<5)
#define USART2_ISR_RXFNE_B_0X1              (0x1U<<5)
#define USART2_ISR_IDLE_B_0X0               (0x0U<<4)
#define USART2_ISR_IDLE_B_0X1               (0x1U<<4)
#define USART2_ISR_ORE_B_0X0                (0x0U<<3)
#define USART2_ISR_ORE_B_0X1                (0x1U<<3)
#define USART2_ISR_NE_B_0X0                 (0x0U<<2)
#define USART2_ISR_NE_B_0X1                 (0x1U<<2)
#define USART2_ISR_FE_B_0X0                 (0x0U<<1)
#define USART2_ISR_FE_B_0X1                 (0x1U<<1)
#define USART2_ISR_PE_B_0X0                 (0x0U<<0)
#define USART2_ISR_PE_B_0X1                 (0x1U<<0)

// ISR_ALTERNATE Configuration

#define USART2_ISR_ALTERNATE_TCBGT          (0x1U<<25)
#define USART2_ISR_ALTERNATE_REACK          (0x1U<<22)
#define USART2_ISR_ALTERNATE_TEACK          (0x1U<<21)
#define USART2_ISR_ALTERNATE_WUF            (0x1U<<20)
#define USART2_ISR_ALTERNATE_RWU            (0x1U<<19)
#define USART2_ISR_ALTERNATE_SBKF           (0x1U<<18)
#define USART2_ISR_ALTERNATE_CMF            (0x1U<<17)
#define USART2_ISR_ALTERNATE_BUSY           (0x1U<<16)
#define USART2_ISR_ALTERNATE_ABRF           (0x1U<<15)
#define USART2_ISR_ALTERNATE_ABRE           (0x1U<<14)
#define USART2_ISR_ALTERNATE_UDR            (0x1U<<13)
#define USART2_ISR_ALTERNATE_EOBF           (0x1U<<12)
#define USART2_ISR_ALTERNATE_RTOF           (0x1U<<11)
#define USART2_ISR_ALTERNATE_CTS            (0x1U<<10)
#define USART2_ISR_ALTERNATE_CTSIF          (0x1U<<9)
#define USART2_ISR_ALTERNATE_LBDF           (0x1U<<8)
#define USART2_ISR_ALTERNATE_TXE            (0x1U<<7)
#define USART2_ISR_ALTERNATE_TC             (0x1U<<6)
#define USART2_ISR_ALTERNATE_RXNE           (0x1U<<5)
#define USART2_ISR_ALTERNATE_IDLE           (0x1U<<4)
#define USART2_ISR_ALTERNATE_ORE            (0x1U<<3)
#define USART2_ISR_ALTERNATE_NE             (0x1U<<2)
#define USART2_ISR_ALTERNATE_FE             (0x1U<<1)
#define USART2_ISR_ALTERNATE_PE             (0x1U<<0)
#define USART2_ISR_ALTERNATE_TCBGT_B_0X0    (0x0U<<25)
#define USART2_ISR_ALTERNATE_TCBGT_B_0X1    (0x1U<<25)
#define USART2_ISR_ALTERNATE_RWU_B_0X0      (0x0U<<19)
#define USART2_ISR_ALTERNATE_RWU_B_0X1      (0x1U<<19)
#define USART2_ISR_ALTERNATE_SBKF_B_0X0     (0x0U<<18)
#define USART2_ISR_ALTERNATE_SBKF_B_0X1     (0x1U<<18)
#define USART2_ISR_ALTERNATE_CMF_B_0X0      (0x0U<<17)
#define USART2_ISR_ALTERNATE_CMF_B_0X1      (0x1U<<17)
#define USART2_ISR_ALTERNATE_BUSY_B_0X0     (0x0U<<16)
#define USART2_ISR_ALTERNATE_BUSY_B_0X1     (0x1U<<16)
#define USART2_ISR_ALTERNATE_UDR_B_0X0      (0x0U<<13)
#define USART2_ISR_ALTERNATE_UDR_B_0X1      (0x1U<<13)
#define USART2_ISR_ALTERNATE_EOBF_B_0X0     (0x0U<<12)
#define USART2_ISR_ALTERNATE_EOBF_B_0X1     (0x1U<<12)
#define USART2_ISR_ALTERNATE_RTOF_B_0X0     (0x0U<<11)
#define USART2_ISR_ALTERNATE_RTOF_B_0X1     (0x1U<<11)
#define USART2_ISR_ALTERNATE_CTS_B_0X0      (0x0U<<10)
#define USART2_ISR_ALTERNATE_CTS_B_0X1      (0x1U<<10)
#define USART2_ISR_ALTERNATE_CTSIF_B_0X0    (0x0U<<9)
#define USART2_ISR_ALTERNATE_CTSIF_B_0X1    (0x1U<<9)
#define USART2_ISR_ALTERNATE_LBDF_B_0X0     (0x0U<<8)
#define USART2_ISR_ALTERNATE_LBDF_B_0X1     (0x1U<<8)
#define USART2_ISR_ALTERNATE_TXE_B_0X0      (0x0U<<7)
#define USART2_ISR_ALTERNATE_TXE_B_0X1      (0x1U<<7)
#define USART2_ISR_ALTERNATE_TC_B_0X0       (0x0U<<6)
#define USART2_ISR_ALTERNATE_TC_B_0X1       (0x1U<<6)
#define USART2_ISR_ALTERNATE_RXNE_B_0X0     (0x0U<<5)
#define USART2_ISR_ALTERNATE_RXNE_B_0X1     (0x1U<<5)
#define USART2_ISR_ALTERNATE_IDLE_B_0X0     (0x0U<<4)
#define USART2_ISR_ALTERNATE_IDLE_B_0X1     (0x1U<<4)
#define USART2_ISR_ALTERNATE_ORE_B_0X0      (0x0U<<3)
#define USART2_ISR_ALTERNATE_ORE_B_0X1      (0x1U<<3)
#define USART2_ISR_ALTERNATE_NE_B_0X0       (0x0U<<2)
#define USART2_ISR_ALTERNATE_NE_B_0X1       (0x1U<<2)
#define USART2_ISR_ALTERNATE_FE_B_0X0       (0x0U<<1)
#define USART2_ISR_ALTERNATE_FE_B_0X1       (0x1U<<1)
#define USART2_ISR_ALTERNATE_PE_B_0X0       (0x0U<<0)
#define USART2_ISR_ALTERNATE_PE_B_0X1       (0x1U<<0)

// ICR Configuration

