Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_usart2.h
#define USART2_ICR_WUCF                     (0x1U<<20)
#define USART2_ICR_CMCF                     (0x1U<<17)
#define USART2_ICR_UDRCF                    (0x1U<<13)
#define USART2_ICR_EOBCF                    (0x1U<<12)
#define USART2_ICR_RTOCF                    (0x1U<<11)
#define USART2_ICR_CTSCF                    (0x1U<<9)
#define USART2_ICR_LBDCF                    (0x1U<<8)
#define USART2_ICR_TCBGTCF                  (0x1U<<7)
#define USART2_ICR_TCCF                     (0x1U<<6)
#define USART2_ICR_TXFECF                   (0x1U<<5)
#define USART2_ICR_IDLECF                   (0x1U<<4)
#define USART2_ICR_ORECF                    (0x1U<<3)
#define USART2_ICR_NECF                     (0x1U<<2)
#define USART2_ICR_FECF                     (0x1U<<1)
#define USART2_ICR_PECF                     (0x1U<<0)

// RDR Configuration

#define USART2_RDR_RDR                      (0x1FFU<<0)
#define USART2_RDR_RDR_0                    (0x1U<<0)

// TDR Configuration

#define USART2_TDR_TDR                      (0x1FFU<<0)
#define USART2_TDR_TDR_0                    (0x1U<<0)

// PRESC Configuration

#define USART2_PRESC_PRESCALER              (0xFU<<0)
#define USART2_PRESC_PRESCALER_0            (0x1U<<0)
#define USART2_PRESC_PRESCALER_B_0X0        (0x0U<<0)
#define USART2_PRESC_PRESCALER_B_0X1        (0x1U<<0)
#define USART2_PRESC_PRESCALER_B_0X2        (0x2U<<0)
#define USART2_PRESC_PRESCALER_B_0X3        (0x3U<<0)
#define USART2_PRESC_PRESCALER_B_0X4        (0x4U<<0)
#define USART2_PRESC_PRESCALER_B_0X5        (0x5U<<0)
#define USART2_PRESC_PRESCALER_B_0X6        (0x6U<<0)
#define USART2_PRESC_PRESCALER_B_0X7        (0x7U<<0)
#define USART2_PRESC_PRESCALER_B_0X8        (0x8U<<0)
#define USART2_PRESC_PRESCALER_B_0X9        (0x9U<<0)
#define USART2_PRESC_PRESCALER_B_0XA        (0xAU<<0)
#define USART2_PRESC_PRESCALER_B_0XB        (0xBU<<0)
